using System.Security.Cryptography.X509Certificates;

namespace CSharp__Homeworks
{
    internal class Homework1
    {
        static void Main(string[] args)
        {
            //Main task
            //int a = 125;
            //int b = (a / 10) * (a / 10 + 1);
            //string res=b.ToString()+25;
            //Console.WriteLine(res);

            //1 Есть число: 32.975, как получить из него дробную часть(975)?
            //Реализуйте в двух вариантах,получите как дробное - 0,975, так и целое - 975 число.

            //double a = 32.375;
            //byte b = Convert.ToByte(a);
            //double res1 = a - b;
            //Console.Write(res1);

            //2 Пользователь вводит с клавиатуры четыре цифры (каждая в свою переменную). Необходимо создать переменную,
            //содержащее эти цифры в виде числа. Например, если с
            //клавиатуры введено 1, 5, 7, 8 тогда необходимо сформировать число 1578.
            //string a=Console.ReadLine();
            //string b = Console.ReadLine();
            //string c = Console.ReadLine();
            //string d = Console.ReadLine();
            
            //int res =Convert.ToInt32(a + b + c + d);
            //Console.WriteLine(res); 

            //3 Одна бабушка захотела выращивать домашний виноград и делать из него изюм.
            //В винограде содержится 92% воды, а после высушивания на печке в изюме остается
            //только 6% воды. Бабушка хочет продать 100 кг изюма. Вопрос: сколько кг винограда
            //бабушке придется для этого вырастить?
            //double res = 100 * 92 / 6;
            //Console.WriteLine(res+" kg");

            //4 Дано действительное число а. Не пользуясь никакими другими арифметическими
            //операциями, кроме умножения, получить 10a за четыре операции.

            //double a = 9.2;
            //string b=a.ToString();
            //string c = "10";
            //Console.WriteLine(c+a);

            //5 Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.
            //В двух строках вводятся два числа (числа целые,положительные, не превышают 1000).
            //Выведите ответ на задачу.

            //short a = 3;
            //short b = 4;
            //double c=Math.Sqrt(Math.Pow(a,2)+ Math.Pow(b, 2));
            //Console.Write(c);

            //6 Напишите код, который принимает с клавиатуры целое положительное двузначное число.
            //Затем следует построить новое значение, составленное из цифр числа, введенного с клавиатуры,
            //но в обратном порядке. После этого новое значение следует увеличить на 8, и окончательный
            //результат вывести на экран. То есть для числа 37 следует построить число 73 и вывести на экран 81.

            //byte a = 37;
            //double b = ((a % 10) * 10) + (a / 10) + 8;
            //Console.WriteLine(b);

        }
    }
}